Tekla.Structures.Model.ControlPolycurve
The Polycurve class defines a user defined polycurve object which contains a chain of line and arc geometries.

Tekla.Structures.Model.ControlPolycurve.#ctor
Creates a new control polycurve instance.
The default values are as follows:
Color = ControlObjectColorEnum.BLUE;
LineType = LineType.DashDot;

Tekla.Structures.Model.ControlPolycurve.#ctor(Tekla.Structures.Geometry3d.Polycurve)
Creates new polycurve instance.
geometry: Geometry of the polycurve.